Repository: 84000/data-translation-memory
Catalog: toh150-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Bhagavān Mañjuśrīkumārabhūta!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་ཞུགས་ཏེ།
en: The Bhagavān was dwelling in Rājagṛha on Vulture Peak Mountain together with a great monastic assembly of 1,250 monks and a multitude of bodhisattva mahāsattvas.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྟན་ལས་ལངས་ཏེ།
en: At that time, the bodhisattva mahāsattva Noble Avalokiteśvara rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་ལྟེ་བ་ལ་བཙུགས་ཏེ།
en: arranged his upper robe on one shoulder, and placed his right knee in the center of a lotus flower.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Joining his hands in devotion toward the Bhagavān, he asked him,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་མ་ཐག་པའི་བྱང་ཆུབ་སེམས་དཔས་ཆོས་དུ་ཞིག་ལ་བསླབ་པར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: “Bhagavān, in how many qualities should a bodhisattva train, just after generating the altruistic mind set on attaining awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavān replied to the bodhisattva mahāsattva Noble Avalokiteśvara’s inquiry with the following words:

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་མ་ཐག་པའི་བྱང་ཆུབ་སེམས་དཔས་ཆོས་བདུན་ལ་བསླབ་པར་བྱ་སྟེ།
en: “Kulaputra, bodhisattvas should train in seven qualities just after generating the altruistic mind set on attaining awakening.

source: བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the seven? They are as follows:

source: རྣམ་པར་རྟོག་པས་ཀྱང་འདོད་པ་ལ་སྟེན་པར་མི་བྱེད་ན་དབང་པོ་གཉིས་ཀྱིས་སྦྱོར་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: One should not have sexual enjoyment even in thought, not to mention joining together the two sexual organs.

source: ཐ་ན་རྨི་ལམ་གྱི་ནང་དུ་ཡང་མི་དགེ་བའི་བཤེས་གཉེན་སྟེན་པར་མི་བྱེད་པ་དང་།
en: One should not take up with a nonvirtuous friend even in dreams.

source: བྱ་དང་འདྲ་བའི་སེམས་ཀྱིས་ཡོངས་སུ་འཛིན་པ་མེད་པར་བྱ་བ་དང་།
en: With a mind free like a bird, one should be completely without grasping.

source: ཐབས་དང་ཤེས་རབ་ལ་མཁས་པས་ང་རྒྱལ་དང་། ངར་འཛིན་པ་མེད་པར་བྱ་བ་དང་།
en: With mastery in skill and wisdom, one should be without pride and reified conceptions of ‘I.’

source: དངོས་པོ་དང་དངོས་པོ་མེད་པ་སྤངས་ནས་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཐར་པ་བརྟན་པོ་དང་ལྡན་པར་བྱ་བ་དང་།
en: One should abandon conceptions of existence and nonexistence and be firm in the emancipation ( vimokṣa ) of emptiness.

source: ཡང་དག་པར་བདེན་པ་མ་ཡིན་པའི་ཀུན་དུ་རྟོག་པའི་ཤེས་པས་སྒྱུ་མ་དང་། རྨི་ལམ་དང་འདྲ་བར་འཁོར་བ་ལས་མངོན་པར་དགའ་བར་བྱ་བ་མ་ཡིན་པ་དང་།
en: One should not take delight in saṃsāra through an inauthentic conceptual understanding, saṃsāra being like a magical illusion or dream.

source: རྒྱུ་དང་འབྲས་བུ་ལ་སྐུར་པ་གདབ་པར་མི་བྱ་བ་སྟེ།
en: And one should refrain from deprecating the law of cause and effect.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་མ་ཐག་པའི་བྱང་ཆུབ་སེམས་དཔས་ཆོས་བདུན་པོ་དེ་དག་ལ་བསླབ་པར་བྱའོ། །
en: “Kulaputra, a bodhisattva who has just generated the altruistic mind set on attaining awakening should train in these seven qualities.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Bhagavān had spoken,

source: བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། དགེ་སློང་དེ་དག་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: the bodhisattva Noble Avalokiteśvara, along with the monks and bodhisattvas, rejoiced and praised highly what had been proclaimed by the Bhagavān.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཞུས་པ་ཆོས་བདུན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the noble Mahāyāna sūtra, “ The Inquiry of Avalokiteśvara on the Seven Qualities

source: རྒྱ་གར་གྱི་མཁན་པོ་དཱི་པཾ་ཀ་ར་ཤྲཱི་ཛྙཱ་ན་དང་། ལོ་ཙྪ་བ་དགེ་སློང་དགེ་བའི་བློ་གྲོས་ཀྱིས་བསྒྱུར་བ།།
en: Translated and edited by the Indian preceptor Dīpaṃkara­śrī­jñāna and the translator monk Gewai Lodrö.
